Series:A Series is a one-dimensional array-like object containing an array of data (of any
NumPy data type) and an associated array of data labels, called its index.

In [3]:
import pandas as pd
from pandas import Series,DataFrame

In [18]:
obj1 = Series([1,1.3,2,3,-4,7,-8,"abv"] , index=(22,33,44,21,5,6,7,8))
obj1

22      1
33    1.3
44      2
21      3
5      -4
6       7
7      -8
8     abv
dtype: object

In [19]:
obj1.values

array([1, 1.3, 2, 3, -4, 7, -8, 'abv'], dtype=object)

In [20]:
obj1.index

Int64Index([22, 33, 44, 21, 5, 6, 7, 8], dtype='int64')

In [23]:
obj1[22] = 2

In [24]:
obj1

22      2
33    1.3
44      2
21      3
5      -4
6       7
7      -8
8     abv
dtype: object

In [28]:
obj1[0:3]

22      2
33    1.3
44      2
dtype: object

In [29]:
obj1*2

22         4
33       2.6
44         4
21         6
5         -8
6         14
7        -16
8     abvabv
dtype: object

In [34]:
3 in obj1

False

In [35]:
obj1

22      2
33    1.3
44      2
21      3
5      -4
6       7
7      -8
8     abv
dtype: object

In [37]:
"abv" in obj1

False

In [38]:
22 in obj1

True

In [45]:
dic = {'a':1,'b':7,'d':-4,'c':66} 
obj2 = pd.Series(dic)  # return Series in sorted order of dictonary Key 
obj2

a     1
b     7
c    66
d    -4
dtype: int64

In [46]:
obj2 = pd.Series(dic,index=('a','b','t','c','d')) # Adding the index values 
obj2

a     1.0
b     7.0
t     NaN
c    66.0
d    -4.0
dtype: float64

In [48]:
pd.isnull(obj2) # finding Missing Values in pandas

a    False
b    False
t     True
c    False
d    False
dtype: bool

In [49]:
pd.notnull(obj2)  # finding Missing Values in pandas

a     True
b     True
t    False
c     True
d     True
dtype: bool

In [50]:
obj2.isnull()

a    False
b    False
t     True
c    False
d    False
dtype: bool

In [51]:
obj2

a     1.0
b     7.0
t     NaN
c    66.0
d    -4.0
dtype: float64

In [52]:
obj2['a']

1.0

In [54]:
obj1

22      2
33    1.3
44      2
21      3
5      -4
6       7
7      -8
8     abv
dtype: object

In [55]:
obj1+obj2

C:\Users\Pawan\Anaconda3\lib\site-packages\pandas\core\indexes\base.py:2984: RuntimeWarning: '<' not supported between instances of 'int' and 'str', sort order is undefined for incomparable objects
  return this.join(other, how=how, return_indexers=return_indexers)

22    NaN
33    NaN
44    NaN
21    NaN
5     NaN
6     NaN
7     NaN
8     NaN
a     NaN
b     NaN
t     NaN
c     NaN
d     NaN
dtype: object

Data alignment: Suppossed we have two Series with some same Index and want to ADD both

In [58]:
Data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame1 = pd.DataFrame(Data)
frame1

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [60]:
frame1.columns = ['Year','State','POP']

In [61]:
frame1

   Year   State   POP
0   1.5    Ohio  2000
1   1.7    Ohio  2001
2   3.6    Ohio  2002
3   2.4  Nevada  2001
4   2.9  Nevada  2002

In [63]:
# "As with Series, if you pass a column that isn’t contained in data, it will appear with NA
# values in the result:
    
    
frmae2 = DataFrame(Data,columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])

In [65]:
frmae2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [66]:
# To show all columns
frmae2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [68]:
# to show Column by Colum name or if we want to print specific columns.
frmae2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [69]:
# To print specific index values 
frmae2.ix['one']

C:\Users\Pawan\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [70]:
frmae2[0:3]

       year state  pop debt
one    2000  Ohio  1.5  NaN
two    2001  Ohio  1.7  NaN
three  2002  Ohio  3.6  NaN

In [74]:
# It will assign all dept values as 16.0
frmae2['dept'] = 16.0

In [75]:
frmae2

       year   state  pop debt  dept
one    2000    Ohio  1.5  NaN  16.0
two    2001    Ohio  1.7  NaN  16.0
three  2002    Ohio  3.6  NaN  16.0
four   2001  Nevada  2.4  NaN  16.0
five   2002  Nevada  2.9  NaN  16.0

In [82]:
# Assigning a column that doesn’t exist will create a new column
import numpy as np
frmae2.debt = np.arange(5)

In [81]:
frmae2

       year   state  pop  debt  dept
one    2000    Ohio  1.5     0  16.0
two    2001    Ohio  1.7     1  16.0
three  2002    Ohio  3.6     2  16.0
four   2001  Nevada  2.4     3  16.0
five   2002  Nevada  2.9     4  16.0

In [90]:
# If you want to assign a specfic values at specfic index

val = pd.Series([1.2,3.2,4.3],index=['one','three','five'])
frmae2['debt'] = val

In [91]:
frmae2

       year   state  pop  debt  dept
one    2000    Ohio  1.5   1.2  16.0
two    2001    Ohio  1.7   NaN  16.0
three  2002    Ohio  3.6   3.2  16.0
four   2001  Nevada  2.4   NaN  16.0
five   2002  Nevada  2.9   4.3  16.0

In [92]:
frmae2['dept'] = 0

In [93]:
frmae2

       year   state  pop  debt  dept
one    2000    Ohio  1.5   1.2     0
two    2001    Ohio  1.7   NaN     0
three  2002    Ohio  3.6   3.2     0
four   2001  Nevada  2.4   NaN     0
five   2002  Nevada  2.9   4.3     0

In [94]:
frmae2["eastern"] = frmae2.state == "Ohio"

In [95]:
frmae2

       year   state  pop  debt  dept  eastern
one    2000    Ohio  1.5   1.2     0     True
two    2001    Ohio  1.7   NaN     0     True
three  2002    Ohio  3.6   3.2     0     True
four   2001  Nevada  2.4   NaN     0    False
five   2002  Nevada  2.9   4.3     0    False

In [107]:
# The del keyword will delete columns as with a dict:

del frmae2['dept']

In [108]:
frmae2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   1.2    False
two    2001    Ohio  1.7   NaN    False
three  2002    Ohio  3.6   3.2    False
four   2001  Nevada  2.4   NaN    False
five   2002  Nevada  2.9   4.3    False

In [110]:
del frmae2.eastern == False

SyntaxError: invalid syntax (<ipython-input-110-dbaefbfd4d95>, line 1)

In [111]:
# Another common form of data is a nested dict of dicts format:
# If passed to DataFrame, it will interpret the outer dict keys as the columns and the inner
# vkeys as the row indices:

pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [112]:
frame3 = pd.DataFrame(pop)

In [113]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [114]:
# you can always transpose the result:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [116]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [127]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}
pdata

{'Nevada': Years
 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64, 'Ohio': Years
 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64}

In [118]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [119]:
frame3.index.name = 'Years'

In [120]:
frame3

       Nevada  Ohio
Years
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [121]:
frame3.columns.name = 'State'

In [122]:
frame3

State  Nevada  Ohio
Years
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [128]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [145]:
obj = Series(range(3), index=['a', 'd', 'c'])

In [146]:
obj

a    0
d    1
c    2
dtype: int32

In [147]:
index = obj.index

In [148]:
index

Index(['a', 'd', 'c'], dtype='object')

In [150]:
index = pd.index(np.arange(3))
obj = Series([1.5,-2.5,0],index=index)
obj2.index is index

AttributeError: module 'pandas' has no attribute 'index'

TypeError: '>' not supported between instances of 'dict' and 'float'

In [158]:
# Reindexing :
""" A critical method on pandas objects is reindex, which means to create a new object
with the data conformed to a new index.

Calling reindex on this Series rearranges the data according to the new index, introducing
missing values if any index values were not already present:
"""


obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [159]:
# Reindexing

obj2 = obj.reindex(['a', 'b', 'c', 'd','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [163]:
# Comparison between Indexing and reindexing
obj3 = obj.index = ['a', 'b', 'c', 'd']
obj3

['a', 'b', 'c', 'd']

In [167]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value= 0)

a    4.5
b    7.2
c   -5.3
d    3.6
e    0.0
dtype: float64

In [168]:
"""
For ordered data like time series, it may be desirable to do some interpolation or filling
of values when reindexing. The method option allows us to do this, using a method such
as ffill which forward fills the values:

"""

obj3 = Series(['blue', 'purple','red'], index= [0,2,4])
obj3

0      blue
2    purple
4       red
dtype: object

In [169]:
obj3.reindex(np.arange(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4       red
5       red
dtype: object

In [171]:
# Fill (or carry) values backward
obj3.reindex(np.arange(6),method='bfill')

0      blue
1    purple
2    purple
3       red
4       red
5       NaN
dtype: object

In [172]:
"""
With DataFrame, reindex can alter either the (row) index, columns, or both. When
passed just a sequence, the rows are reindexed in the result:
"""

Dframe = pd.DataFrame(np.arange(9).reshape(3,3), index=['a','c','d'],columns=['Ohio', 'Texas' , 'California'])
Dframe

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [173]:
Dframe.reindex(['a','b','c','d'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [174]:
# The columns can be reindexed using the columns keyword:

states = ['Texas', 'Utah', 'California']
Dframe.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [177]:
# Dropping entries from an axis

obj

a    4.5
b    7.2
c   -5.3
d    3.6
dtype: float64

In [182]:
obj.drop(['a','b'])

c   -5.3
d    3.6
dtype: float64

In [184]:
obj.drop('c')

a    4.5
b    7.2
d    3.6
dtype: float64

In [186]:
DataFrame1 = pd.DataFrame(np.arange(16).reshape((4,4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
DataFrame1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [187]:
DataFrame1.T

       Ohio  Colorado  Utah  New York
one       0         4     8        12
two       1         5     9        13
three     2         6    10        14
four      3         7    11        15

In [188]:
DataFrame1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [190]:
DataFrame1.drop('one', axis=1)

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [191]:
DataFrame1.drop("Ohio") # By default Axis will be 0

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [192]:
DataFrame1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [200]:
# Indexing, selection, and filtering

obj = pd.Series(np.arange(4),index=['a', 'b', 'c', 'd'])
obj

a    0
b    1
c    2
d    3
dtype: int32

In [204]:
obj[['a','b']]

a    0
b    1
dtype: int32

In [208]:
obj.values[0]

0

In [210]:
obj[2:6]

c    2
d    3
dtype: int32

In [211]:
obj['b':'c'] = 5

In [212]:
obj

a    0
b    5
c    5
d    3
dtype: int32

In [213]:
DataFrame1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [219]:
DataFrame1['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [220]:
DataFrame1[DataFrame1['two']> 5]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [221]:
DataFrame1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [223]:
DataFrame1.ix['Colorado', ['two', 'three']]

C:\Users\Pawan\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: Colorado, dtype: int32

In [226]:
DataFrame1.ix[['Colorado','Utah'],[3,0,1]] # [Row,Coloum as a Index]

          four  one  two
Colorado     7    4    5
Utah        11    8    9